{
    "undergraduate": 
    {
        "mathematics": 
        {
            "enrolment_quota": "Undergraduate Study Programme in Mathematics (3 years), 44 full-time students and 1 foreign student",
            "tuition_fee": "Tuition fee is HRK 5500 per year.",
            "admission_requirments": {
                "admission_medium": "Registration for both the state graduation exam and the study programmes offered by the Department of Mathematics is done for all applicants through the National Information System of Applications to Higher Education Institutions (NISpVU), which can be accessed through the website www.postani-student.hr.",
                "base_requirments": "For admission to the undergraduate university study programme in Mathematics and the undergraduate university study programme in Mathematics and Computer Science, applicants must have completed their four-year secondary school education and passed the state graduation exam in each of the following three subjects:\u000A \u000A A-level mathematics,\n Croatian at level A or B, and\n foreign language at level A or B.",
                "addmision_points": "Applicants who participated in a national competition in mathematics or informatics during their high school education are eligible for direct admission to the study programme, i.e., they are awarded the maximum number of admission points (i.e., 100%).\u000A\u000A Based on their high school success, applicants can achieve a maximum of 20% admission points. \u000A \u000A On the basis of the state graduation exam results, points are allocated as follows:\nMathematics – threshold 40% (maximum of 50% admission points), and \u000A Informatics (a maximum of 20% admission points).\u000A\u000A The informatics exam passed as part of the state graduation exam is not considered as an admission requirement.\u000A \u000A Applicants can achieve the remaining 10% of admission points by means of special achievements in the field of mathematics or informatics on the basis of the following criteria:\u000A participation in a competition - one of the following three competitions is taken into account:\u000A participation in a county high school mathematics or informatics competitions provides 100 specific points;_participation in a primary school national or regional competitions in mathematics or informatics provides 50 specific points;_participation in a primary school county competition in mathematics or informatics provides 30 specific points;_if the applicant's name is published on the list of students who have correctly solved a mathematics or informatics related task given in a professional journal, this provides 30 specific points;_if a professional paper in the field of mathematics or informatics is published in a professional journal, this provides 100 specific points; and_presentation at a professional mathematics or informatics conference provides 100 specific points.\u000A Applicants who earn at least 100 specific points under the aforementioned criteria are recognised all 10% of admission points. Applicants who score less than 100 specific points under these criteria are recognised a corresponding percentage of admission points.", 
                "addmision_dates": "Admission of eligible applicants takes place as follows:\nsummer admission period – 22 July 2021, 8:00 a.m.-12:00 a.m,\n fall admission period – 20 September 2021, 8:00 a.m.-12:00 a.m.\n The following supporting documents are required for admission:\nOne photograph (4 cm x 6 cm),\n A copy of the ID card,\n A confirmation that the admission fee of HRK 330 (i.e. HRK 300 for application, enrolment and enrolment related costs, and HRK 30 for Student Union projects) was paid to the Department of Mathematics account IBAN HR3725000091402000049 (Model HR00, beneficiary reference - a student personal identification number or OIB),\n A confirmation that the tuition fee for students who enrol in the first year of study for the second time was paid to the Department of Mathematics account IBAN HR3725000091402000049 (Model HR00, beneficiary reference - a student personal identification number or OIB), and\u000A A state graduation exam certificate and/or a certificate of achievement in the state graduation exam.\n\n Applicants who fail to exercise their right to enrol at the Department of Mathematics in the period in which they earned this right shall waive their right to enrolment."
            }
        },
        "mathematics&computer_science":
        {
            "enrolment_quota": "Undergraduate Study Programme in Mathematics and Computer Science (3 years), 44 full-time students and 1 foreign student\n ",
            "tuition_fee": "Tuition fee is HRK 5500 per year.\n ",
            "admission_requirments": {
                "admission_medium": "Registration for both the state graduation exam and the study programmes offered by the Department of Mathematics is done for all applicants through the National Information System of Applications to Higher Education Institutions (NISpVU), which can be accessed through the website www.postani-student.hr. \n",
                "base_requirments": "For admission to the undergraduate university study programme in Mathematics and the undergraduate university study programme in Mathematics and Computer Science, applicants must have completed their four-year secondary school education and passed the state graduation exam in each of the following three subjects:\nA-level mathematics,\n Croatian at level A or B, and_foreign language at level A or B. \n",
                "addmision_points": "Applicants who participated in a national competition in mathematics or informatics during their high school education are eligible for direct admission to the study programme, i.e., they are awarded the maximum number of admission points (i.e., 100%).\n Based on their high school success, applicants can achieve a maximum of 20% admission points.\n On the basis of the state graduation exam results, points are allocated as follows:\nMathematics – threshold 40% (maximum of 50% admission points), and_Informatics (a maximum of 20% admission points).\n The informatics exam passed as part of the state graduation exam is not considered as an admission requirement.\n Applicants can achieve the remaining 10% of admission points by means of special achievements in the field of mathematics or informatics on the basis of the following criteria:\nparticipation in a competition - one of the following three competitions is taken into account:\nparticipation in a county high school mathematics or informatics competitions provides 100 specific points;_participation in a primary school national or regional competitions in mathematics or informatics provides 50 specific points;_participation in a primary school county competition in mathematics or informatics provides 30 specific points;_if the applicant's name is published on the list of students who have correctly solved a mathematics or informatics related task given in a professional journal, this provides 30 specific points;_if a professional paper in the field of mathematics or informatics is published in a professional journal, this provides 100 specific points; and_presentation at a professional mathematics or informatics conference provides 100 specific points.\n Applicants who earn at least 100 specific points under the aforementioned criteria are recognised all 10% of admission points. Applicants who score less than 100 specific points under these criteria are recognised a corresponding percentage of admission points. \n",
                "addmision_dates": "Admission of eligible applicants takes place as follows:\nsummer admission period – 22 July 2021, 8:00 a.m.-12:00 a.m,\n fall admission period – 20 September 2021, 8:00 a.m.-12:00 a.m.\n The following supporting documents are required for admission:\nOne photograph (4 cm x 6 cm),\n A copy of the ID card,\n A confirmation that the admission fee of HRK 330 (i.e. HRK 300 for application, enrolment and enrolment related costs, and HRK 30 for Student Union projects) was paid to the Department of Mathematics account IBAN HR3725000091402000049 (Model HR00, beneficiary reference - a student personal identification number or OIB),\n A confirmation that the tuition fee for students who enrol in the first year of study for the second time was paid to the Department of Mathematics account IBAN HR3725000091402000049 (Model HR00, beneficiary reference - a student personal identification number or OIB), and_A state graduation exam certificate and/or a certificate of achievement in the state graduation exam.\n Applicants who fail to exercise their right to enrol at the Department of Mathematics in the period in which they earned this right shall waive their right to enrolment. \n"
            }
        }
    },
    "graduate":
    {
       "financial_mathematics&statistics":
       {
            "enrolment_quota": "Graduate Study Programme in Financial Mathematics and Statistics (2 years), 58 full-time students and 2 foreign student \n",
            "tuition_fee": "Tuition fee is HRK 5500 per year. \n",
            "admission_requirments": {
                "info": "Applicants who have completed their undergraduate university study programme in Mathematics or any other related undergraduate university study programme may enrol in the graduate university study programme in Mathematics, fields of specialisation: Financial Mathematics and Statistics, and Mathematics and Computer Science.\n Applicants who have completed an undergraduate university study programme in mathematics, an undergraduate university study programme in mathematics and computer science, or any other related undergraduate university study programme at any Croatian or foreign university may enrol in the Graduate mathematics and informatics education study programme if they have achieved a minimum of 150 ECTS credit in mathematics and informatics related courses in the aforementioned study programme, with the possibility of compensating the required number of ECTS credits by enrolling in appropriate elective courses awarding up to 30 ECTS credits, which will be determined by the Enrolment Committee in the enrolment procedure.\n No entrance examination will be held for enrolment in the graduate university study programmes. The ranking lists are determined on the basis of the weighted average grades achieved in the undergraduate university study programme. The grade is expressed to three (3) decimal places.\n ",
                "info2": "The application must be accompanied by:\nA certificate or diploma of the completed undergraduate university study programme or any other study programme,\n An official transcript of records or diploma supplement,\n Certificates confirming participation in international mathematics competitions for university students, or a student success award (if any), and_The admission procedure application form duly filled in.\n The application form can be obtained at the Student Administration Office.\n When enrolling, each applicant must enclose a confirmation that the admission fee of HRK 330 (i.e. HRK 300 for application, enrollment and enrolment related costs, and HRK 30 for Student Union projects) was paid to the Department of Mathematics account IBAN HR3725000091402000049 (Model HR00, beneficiary reference - a student personal identification number or OIB), a copy of the ID card and two photographs. \n"
            }
       },
       "mathematics&computer_science":
       {
            "enrolment_quota": "Graduate Study Programme in Mathematics and Computer Science (2 years), 58 full-time students and 2 foreign student \n",
            "tuition_fee": "Tuition fee is HRK 5500 per year.\n",
            "admission_requirments": {
                "info": "Applicants who have completed their undergraduate university study programme in Mathematics or any other related undergraduate university study programme may enrol in the graduate university study programme in Mathematics, fields of specialisation: Financial Mathematics and Statistics, and Mathematics and Computer Science.\n Applicants who have completed an undergraduate university study programme in mathematics, an undergraduate university study programme in mathematics and computer science, or any other related undergraduate university study programme at any Croatian or foreign university may enrol in the Graduate mathematics and informatics education study programme if they have achieved a minimum of 150 ECTS credit in mathematics and informatics related courses in the aforementioned study programme, with the possibility of compensating the required number of ECTS credits by enrolling in appropriate elective courses awarding up to 30 ECTS credits, which will be determined by the Enrolment Committee in the enrolment procedure.\n No entrance examination will be held for enrolment in the graduate university study programmes. The ranking lists are determined on the basis of the weighted average grades achieved in the undergraduate university study programme. The grade is expressed to three (3) decimal places. \n",
                "info2": "The application must be accompanied by:\n A certificate or diploma of the completed undergraduate university study programme or any other study programme,\n An official transcript of records or diploma supplement,\n Certificates confirming participation in international mathematics competitions for university students, or a student success award (if any), and_The admission procedure application form duly filled in.\n The application form can be obtained at the Student Administration Office.\n When enrolling, each applicant must enclose a confirmation that the admission fee of HRK 330 (i.e. HRK 300 for application, enrollment and enrolment related costs, and HRK 30 for Student Union projects) was paid to the Department of Mathematics account IBAN HR3725000091402000049 (Model HR00, beneficiary reference - a student personal identification number or OIB), a copy of the ID card and two photographs. \n"
            }
       }
    }
}