{
    "M084/Differential Calculus": "The course Differential calculus is performed in the winter semester of the first year of the university undergraduate study of mathematics and the university undergraduate study of mathematics and computer science. The aim of the course is to introduce students to the basic ideas and methods of mathematical analysis that are the basis for many other courses. Through lectures, basic concepts will be covered and their usefulness and application will be illustrated. In the exercises, students need to master the appropriate technique and be able to solve specific problems.",
    "M085/Integral Calculus": "The course Integral Calculus is taught in the summer semester of the first year of university undergraduate study of mathematics and university undergraduate study of mathematics and computer science. The aim of the course is to introduce students to the basic ideas and methods of mathematical analysis that are the basis for many other courses. Through lectures, basic concepts will be covered and their usefulness and application will be illustrated. In the exercises, students need to master the appropriate technique and be able to solve specific problems.",
    "M087/Linear Algebra II": "Linear Algebra II is performed in the summer semester of the first year of the undergraduate study of Mathematics and the university undergraduate study of Mathematics and Computing. The aim of the course is to acquaint students with the concepts and properties of vector and unitary spaces, the basic properties of linear operators over finite-dimensional spaces, scalar product and unitary spaces.",
    "M101/Elementary Geometry": "Elementary geometry is performed in the summer semester of the first year of university undergraduate study of mathematics. The aim of the course is to systematize, consolidate and deepen the knowledge of elementary, elementary, synthetic geometry without interfering with the axiomatic construction of geometries. Classical geometric contents will be updated as much as possible by demonstrations with the help of computer tools of dynamic geometry in lectures and exercises.",
    "M100/Elementary Mathematics": "Elementary mathematics is performed in the winter semester of the first year of university undergraduate study of mathematics. The aim of the course is to renew and expand students' knowledge of elementary mathematics, which creates a solid foundation for students to have fundamental mathematical knowledge necessary for the further course of studies.",
    "M102/Combinatorial and Discrete Mathematics": "Combinatorial and discrete mathematics is performed in the summer semester of the first year of university undergraduate study of mathematics. The aim of the course is to acquaint students with the basic structures and methods of combinatorial and discrete mathematics. The lectures will cover the basic methods of counting sets and multisets, methods of modeling and solving recursive relations. Students will adopt the concept of derivative function and basic concepts from graph theory. In the exercises, students should master the techniques and methods of solving tasks and be able to solve specific problems.",
    "M086/Linear Algebra I": "Linear algebra I is performed in the winter semester of the first year of university undergraduate study of mathematics and university undergraduate study of mathematics and computer science. The aim of the course is to adopt the basic concepts and methods of linear algebra, mastering the work with matrices and manipulation with vectors in the plane and space, and with basic examples of vector spaces.",
    "Z011/English/German for Mathematics and Computer Science Students I": "Strani jezik u struci I izvodi se u zimskom i ljetnom semestru prve godine sveučilišnog preddiplomskog studija matematike i sveučilišnog nastavničkog studija matematike i informatike. Cilj kolegija je usvajanje osnovne terminologije iz područja matematike i informatike te što korektnija primjena gramatičkih struktura koje su karakteristične za jezik u struci. Osposobljavanje studenata za čitanje stručne literature i vođenje razgovora o nekim osnovnim temama vezanim uz struku.",
    "Z012/English/German for Mathematics and Computer Science Students II": "Foreign language in profession II is performed in the winter and summer semesters of the second year of university undergraduate study of mathematics and university teacher study of mathematics and informatics. The aim of the course is to adopt professional vocabulary in the field of mathematics and informatics and the most correct application of grammatical structures that are characteristic of the language in the profession. Enabling students to read and understand professional literature, discuss topics related to the profession and translate simpler professional texts from their mother tongue into a foreign language. Enabling students to independently present a selected professional topic in a foreign language.",
    "Z014/Physical Education I": "The program basis consists of sets of various kinesiological activities that can be divided into basic curriculum and elective program. Students opt for them with regard to the interest, the degree of acquisition of motor skills, the level of ability, health status, interest in the competition and the material working conditions available to the university or department. The basic program is planned from the following kinesiological activities (walking, running, basketball, football, handball, volleyball, fitness, skating, racket sports, martial arts, bowling ...) while the elective program consists of activities and competitions that students choose and perform in their free time respecting certain rules and conditions (dance structures, swimming, aerobics, hiking tours, zumba, university competitions, 'gps' activities…).",
    "M009/Multivariable Calculus": "The course Functions of Multiple Variables is performed in the winter semester of the second year of the university undergraduate study of mathematics and the university teacher study of mathematics and informatics. The aim of the course is to acquaint students with the differential and integral calculus of real and vector functions of several real variables. The lectures will introduce basic concepts and process their properties, and illustrate with examples, while in the exercises students will adopt appropriate techniques for solving specific problems.",
    "M015/Complex Analysis": "The complex analysis is performed in the summer semester of the second year of the university undergraduate study of mathematics and the university teacher study of mathematics and informatics. The aim of the course is to present to students the classical theory of complex functions of a complex variable, and to acquaint them with the specific properties of these functions, emphasizing the important differences in relation to the functions of real variables.",
    "M089/Numerical Mathematics": "Numerical mathematics is performed in the winter semester of the second year of the university undergraduate study of mathematics and the third year of the university undergraduate study of mathematics and computer science. Students will be introduced to the main ideas and methods of numerical mathematics. The methods will be accompanied by a number of illustrative examples.",
    "M095/Statistical Practice": "The statistical practicum is performed in the summer semester of the second year of undergraduate study of mathematics and as an elective course in the third year of undergraduate study of mathematics and computer science. The aim of the course is to develop the skill of statistical data analysis using basic statistical methods and statistical programming environment.",
    "M108/Number Theory": "Number theory is performed in the summer semester of the second year of the university undergraduate study of mathematics and the university teacher study of mathematics and informatics. The aim of this course is to acquaint students with the basic concepts, ideas and methods of elementary number theory.",
    "M098/Introduction to Probability and Statistics": "An introduction to probability and statistics is performed in the winter semester of the second year of the University’s undergraduate study of mathematics. The aim of the course is to acquaint students with the basic concepts of probability theory and statistics. The emphasis is on the introduction of basic concepts, their interpretation, adoption and understanding of basic properties, mastering basic techniques and methods and their application.",
    "I027/Mathematical Tools": "The subject Mathematical Tools is performed in the winter semester of the second year of the university undergraduate study of mathematics. The aim of the course is to acquaint and train students to work with modern tools for mathematical calculations and illustrations (Mathematica and MATLAB) and a standard system for writing professional and scientific documents LaTeX. During the classes, examples from various fields of mathematics, physics, economics and engineering will be made.",
    "Z015/Physical Education II": "The program basis consists of sets of various kinesiological activities that can be divided into basic curriculum and elective program. Students opt for them with regard to the interest, the degree of acquisition of motor skills, the level of ability, health status, interest in the competition and the material working conditions available to the university or department. The basic program is planned from the following kinesiological activities (walking, running, basketball, football, handball, volleyball, fitness, skating, racket sports, martial arts, bowling ...) while the elective program consists of activities and competitions that students choose and perform in their free time respecting certain rules and conditions (dance structures, swimming, aerobics, hiking tours, zumba, university competitions, 'gps' activities…).",
    "M094/Real Analysis": "The course Realistic Analysis is performed in the winter semester of the third year of the university undergraduate study of mathematics and the university teacher study of mathematics and informatics. The aim of the course is to process and deepen the material of the course Differential calculus and Integral calculus in a mathematically formal way.",
    "M083/Algebra": "The Algebra course is conducted in the summer semester of the third year of the university undergraduate study of mathematics and the university teacher study of mathematics and informatics. The aim of the course is to acquaint students with basic algebraic structures and their properties. The lectures will introduce and process the basic concepts and prove their properties and interrelationships, accompanied by numerous examples, with special emphasis on the examples seen in previously studied subjects. In the exercises, students will master the techniques of examining the properties of abstract algebraic structures and solving problem problems.",
    "M090/Ordinary Differential Equations": "The course Ordinary Differential Equations is performed in the winter semester of the third year of the university undergraduate study of mathematics and the university teacher study of mathematics and informatics. The aim of the course is to acquaint students with the concept and geometric meaning of ordinary differential equations, general theorems on the existence and uniqueness of solutions and show the basic types and methods for solving, with special emphasis on the theory of linear equations.",
    "Z007/Final Paper": "https://www.mathos.unios.hr/images/homepages/vfotak/dokumenti/Pravilnik_o_zavr%C5%A1nim_radovima_-_pro%C4%8Di%C5%A1%C4%87eni_tekst_2020.pdf",
    "I044/Functional Programming": "Functional programming is performed in the winter semester of the first year of the university undergraduate study of Mathematics and Computing. The aim of the course is to acquaint students with the basic ideas and methods of functional programming that treats computation as an evaluation of mathematical functions.",
    "I056/Introduction to Computer Science": "The introduction to computer science is performed in the winter semester of the first year of the undergraduate study program Mathematics and the university undergraduate study program Mathematics and Computing. The aim of the course is at the initial level to acquaint students with the basic ideas and methods of computing that are the basis for other computer courses.",
    "M088/Mathematical Logic in Computer Science": "Mathematical logic in computer science is performed in the summer semester of the first year of the university undergraduate study of Mathematics and Computing. The aim of the course is to acquaint students with the basic concepts of mathematical logic and the acquisition of knowledge needed for automated proof of theorems and program verification, and to master the techniques needed to use the COQ proof assistant.",
    "I048/Object Oriented Programming": "Object-oriented programming is performed in the summer semester of the first year of the university undergraduate study of mathematics and computer science. The aim of the course is to acquaint students with the basics of object-oriented programming using the C ++ programming language and to gain prior knowledge that will be useful to them in team and independent solving of program tasks.",
    "I046/Modern Database Systems": "The course Modern Database Systems is conducted in the summer semester of the second year of the university undergraduate study of Mathematics and Computing. The aim of the course is to acquire knowledge about modern database systems and their application in the development of practical solutions and to acquire skills in working on Oracle, MySQL, MongoDB and Hadoop database management systems.",
    "M091/Applied Math for Computer Science": "The main goal of the course is to acquaint students with areas of mathematics that have wide application in computer science. The lectures cover selected chapters from four areas: combinatorics, probabilities, number theory and multivariate functions. In the exercises, students approach specific problems that require the application of previously acquired knowledge.",
    "I053/Data Structures and Algorithms I": "The course Data Structures and Algorithms I is in the winter semester of the second year of undergraduate study of mathematics and undergraduate study of mathematics and computer science. The aim of the course is to acquaint students with the types and uses of simple and complex data structures and algorithms and to use them in practical application in the object-oriented programming language C ++.",
    "I054/Data Structures and Algorithms II": "The course Data Structures and Algorithms II is conducted in the summer semester of the second year of the undergraduate study of mathematics and the undergraduate study of mathematics and computer science. The main goal of this course is to acquaint students with advanced data structures and algorithms on graphs as well as their application in a wide range of computer problems. In addition to the algorithmic approach, they present selected chapters from graph theory. At the end of the course, students are introduced to selected algorithms from number theory and computational geometry. In addition to the theoretical approach, students will be expected to successfully use the acquired knowledge in the development of efficient implementations of data structures and algorithms that are processed within the course.",
    "I045/Modern Computer System": "Modern computer systems are performed in the winter semester of the second year of university undergraduate study of mathematics and computer science. The aim of the course is to acquaint students with the basic logic circuits and use them to build a functional computer. November will be introduced to the concepts of designing and testing assemblies using Hardware description language (HDL), designing assembly languages, hardware abstraction using a virtual machine as well as compiling a simple object-oriented programming language.",
    "M097/Theoretical Foundations of Computer Science": "Get acquainted with abstract machines and the problems they can solve (automata theory) and formal languages ​​(regular languages ​​and context-independent languages). The emphasis will be on ways of thinking that will allow students to better understand the theory of automata and formal languages. Through exercises, students will be introduced to many examples of formal languages ​​in different programming languages. Teaching is performed through lectures and exercises.",
    "I057/Full Stack Web Development": "Web programming is performed in the summer semester of the first year of the university graduate study of mathematics and computer science. The aim of the course is to enable students to independently master the basic concepts of WEB programming using standard and modern web technologies proposed by the World Wide Web Consortium (W3C).",
    "I058/Final Project": "In the last semester, undergraduate students of Mathematics and Computing must demonstrate the acquired skills and knowledge by creating a final practical project.",
    "I052/Software Engineering": "The main goal of this course is to acquaint students with project management frameworks.",
    "M118/Probability": "Probability is performed in the winter semester of the first year of the University graduate study of mathematics, majoring in financial mathematics and statistics. The aim of the course is for students to master the necessary contents of general probability theory in order to be able to understand probability theory as a mathematical discipline and its application. When choosing the content, the needs of a group of subjects based on probability theory are taken into account (statistics, random processes, time series analysis, multivariate analysis, etc.).",
    "M120/Statistics": "Statistics are performed in the summer semester of the first year of graduate study of financial mathematics and statistics. The aim of the course is to enable students to get acquainted with the basics of mathematical statistics. Students are expected to understand the methods of statistical reasoning based on this course and to be able to apply them correctly. Also, the development of skills for conducting statistical analyzes on data is envisaged.",
    "M119/Stochastic Processes I": "The course Random Processes I is conducted in the winter semester of the first year of the University graduate study of mathematics, majoring in financial mathematics and statistics. The aim of the course is to adopt theoretical concepts related to the basic types of random processes in discrete time, to understand analytical techniques for solving problems in theory and practice and to identify possible applications of random processes.",
    "M121/Stochastic Processes II": "The course Random Processes II is performed in the second semester of the University graduate study of mathematics, majoring in financial mathematics and statistics. The aim of the course is to adopt theoretical concepts related to the basic types of random processes in continuous time, to understand analytical techniques for solving problems in theory and practice and to identify possible applications of random processes in practice.",
    "M008/Financial and Actuarial Mathematics": "The course is conducted in the winter semester of the first year of graduate study. In lectures and classroom exercises, students will learn the basic concepts, notations and principles of financial and actuarial mathematics. Also, students will be introduced to basic techniques of financial mathematics, with examples and application in everyday business situations.",
    "E012/Macroeconomics I": "Macroeconomics I is performed in the winter semester of the first year of the university graduate study in Financial Mathematics and Statistics. The aim of the course is to enable students to acquire the competencies needed to independently conduct analysis of economic behavior, research the causes of fundamental macroeconomic problems and evaluate the effects of macroeconomic policy, primarily monetary and fiscal, on the behavior and performance of the economy.",
    "E013/Macroeconomics II": "Macroeconomics II is performed in the summer semester of the first year of the university graduate study in Financial Mathematics and Statistics. The objectives of the course are to integrate and deepen students' knowledge of closed and open economy behavior, enable them to acquire competencies for independent analysis and critical evaluation of macroeconomic policy effects over time, within more complex macroeconomic models, and application of acquired competencies in analysis and evaluation of real macroeconomic events and situations.",
    "MIP001/Master Thesis": "As part of this course, students hold presentations of their graduate theses before the Graduate Exam. One of the main goals of this course is for students to master presentation skills, which are necessary in the business world today. Estimated time for each presentation is up to 40 minutes.",
    "M122/Multivariate analysis": "The aim of the course is to acquaint students with the basic models for statistical inference about a random vector, to enable them to understand and apply the method of multivariate analysis to data analysis.",
    "M003/Time Series": "The analysis of time series is performed in the summer semester of the second year of the university graduate study of mathematics as a compulsory course in financial mathematics and statistics and as an elective course in industrial and applied mathematics. The aim of the course is to acquaint students with the basic models from the theory of time series. Special attention is paid to time series models that are relevant from the point of view of economics and financial mathematics. Part of the teaching is dedicated to the practical application of this theory and the analysis of real time series. Basic concepts and models are introduced through lectures. Their usefulness and application are especially illustrated. Through seminars, students need to master the appropriate technique and be able to solve specific problems with the help of computers.",
    "M123/Mathematical Finance": "The course Mathematical Finance is conducted in the summer semester of the second year of the University graduate study of mathematics, majoring in financial mathematics and statistics. The aim of the course is to acquaint students with the basic methodology and concepts of modern financial mathematics. In its mathematical part, the subject is primarily based on the theory of martingales and stochastic differential equations. Through lectures, basic concepts are introduced in an informal and intuitive way. Special attention is paid to examples and applications. In the exercises, students should master the appropriate technique and be able to solve specific problems with the use of computers.",
    "E001/Business Analysis": "Financial markets are performed in the summer semester of the second year of the University graduate study of mathematics in the fields: Financial Mathematics and Statistics and Mathematics and Computing. Students will gain basic knowledge about the functioning of the financial system and its markets. Special attention will be paid to the basic participants and their influence on the movement of interest rates and securities prices. Within the lecture, students will be introduced to the basic categorical system, and the seminar will show examples of movements in securities prices on stock exchanges and interest rates, with the calculation of realized returns for individual investments.",
    "E009/Credit Risk Management": "Credit risk management is performed in the winter semester of the second year of the University graduate study of mathematics in the field of: Financial mathematics and statistics. The goal of the course is to teach students what credit risk is. Teach students part of credit risk theory. Learn what are the factors influencing the risk - companies, small businesses, households. Learn to create scoring / rating models. Learn to validate scoting / rating models. Learn the basic concepts of the Basel 2 standard. The emphasis is on building, testing and applying scoring models in practice. Through this course, students work on specific data of credit institutions.",
    "MI009/Applied linear algebra and scientific computing": "Applied linear algebra and scientific computing is performed in the winter semester of the first year of the university graduate study of mathematics, majoring in Mathematics and Computing. The aim of the course is to acquaint students with the basic ideas and methods of numerical linear algebra used in solving linear systems, least squares problems, eigenvalue and singular problems. To teach students how to use computers in science with applications in numerical linear algebra but also numerical analysis (linear and nonlinear equations, integration, interpolation, simulations and optimizations). In the exercises, students will learn to program sequential and parallel programs in Octave or Matlab and analyze algorithms with good numerical properties. Connect mathematical and computer knowledge.",
    "I066/Intelligent Robotic Systems": "Intelligent robotic systems are performed in the summer semester of the first year of the university graduate study of mathematics and computer science. The aim of the course is to acquaint students with the basics of robotics: kinematics, dynamics, state management, state assessment and computer vision. Students will implement each of the presented topics independently in the Python programming language (matplotlib, numpy, PyTorch, OpenCV) or on an actual robot.",
    "MI008/Semantics of programming languages": "Introduce students to the abstract model of programming languages ​​𝜆-calculus. Explain the general properties of a program that can modify other programs in an abstract environment unencumbered by detail. Master the terms variable, abstraction (functional definition), application of a function to an argument (Application). Connect these concepts with the concepts of functional programming and the Haskell or Coq language.",
    "M128/Linear optimization": "Introduce students to modeling, solving, and interpreting real problems that can be reduced to linear optimization. To process and analyze known numerical methods for solving linear optimization problems as well as present appropriate geometric interpretations.",
    "I067/Operating systems": "To define basic concepts and principles of the modern operating systems. To introduce the problematics of multi-threaded and multi-process computing, virtual memory, file system, input, output and interrupts. Students will gain an insight into modern concepts of virtualization, multi-processor and distributed systems as well as cloud-based systems. The notion of security will be introduced and put into the context of modern operating systems. Above mentioned concepts will be implemented and studied on the examples of real operating systems.",
    "I068/Advanced programming techniques": "Introduce students with design patterns and how they can help in design object-oriented software. Students will design a case study that will demonstrate how design patterns apply in practice. Special emphasis will be on the practical implementation of such concepts in C ++ language.",
    "M129/Nonlinear optimization": "Introduce students to how to approach real-time problems of nonlinear optimization that occur in different applications. Particular consideration will be given to setting the problem, solving it and interpreting the results. Known numerical methods for solving one-dimensional and multidimensional problems of differentiable and nondifferentiable nonlinear optimization will be analyzed and analyzed. The methods will be illustrated and tested in numerous examples using a computer. In this way mathematical and computer knowledge will be linked."
}