{
    "undergraduate": 
    {
        "mathematics": 
        {
            "general": "Undergraduate university study programme in mathematics offered by the Department of Mathematics, Josip Juraj Strossmayer University of Osijek, is based on modern study programmes of well-known Croatian and foreign universities. A high level of compliance of this study programme with study programmes considered above shall allow the flow of mathematics students between the University of Osijek and most European universities.\n\n",
            "achievements": "Undergraduate university study programme in mathematics is the first stage in the system of university education of mathematicians. After completing this study programme, graduates are awarded a Bachelor of Mathematics (BMath) degree, they have open access to the labour market, and they are also capable of enrolling in graduate study programmes in mathematics and its various specific fields as well as graduate study programmes in other fields that require good foundations of mathematics and computer science knowledge. By its syllabus, as well as the forms and methods of teaching, the study programme enables adoption and understanding of: the basic knowledge of major areas of mathematics, and the basic knowledge of computer science. During their study, BMath degree holders also develop the following competencies: practical application of acquired knowledge in mathematics and computer science, and solving problems in other (not necessarily mathematical) areas by applying mathematical models and computers. Forms and methods of teaching contribute to the development of: the learning ability and inclination to scientific research, communication and presentation skills. Students are also encouraged to learn and speak at least one foreign language.\n\n",
            "competencies": "A BMath degree holder is qualified to work in industry, government and the public sector that require basic knowledge of mathematics and computer science, and the ability of mathematical modelling and solving different (not necessarily mathematical) problems by using computers. (S)He is also qualified to perform tasks that require analytical thinking, the organisational ability as well as analysis and presentation of data.\n\n",
            "end_of_study": "Undergraduate university study programme in mathematics is completed by passing all the exams and writing the final paper, which includes studying the existing literature on a given topic and a systematic presentation of the paper.\n\n"
        },
        "mathematics&computer_science":
        {
            "general": "The new and modern University undergraduate study program Mathematics and Computing was developed in cooperation with member companies of the Osijek Software City Association, following the example of similar Computer Science undergraduate studies at European and American universities. The main goal of such a program is to form a study program that will better prepare students for the labor market in IT, perhaps the fastest growing branch of industry in the Republic of Croatia. The study program of the undergraduate university study of Mathematics and Computing is unique in its structure and content of the course precisely due to the fact that it combines knowledge and skills from two areas, mathematics and computing. The structure of the proposed study program is motivated by undergraduate Computer Science studies from the University of Saarland, Saarbruecken, and the University of Stuttgart.\n\n",
            "achievements": "Undergraduate university study programme in mathematics is the first stage in the system of university education of mathematicians. After completing this study programme, graduates are awarded a Bachelor of Mathematics (BMath) degree, they have open access to the labour market, and they are also capable of enrolling in graduate study programmes in mathematics and its various specific fields as well as graduate study programmes in other fields that require good foundations of mathematics and computer science knowledge. By its syllabus, as well as the forms and methods of teaching, the study programme enables adoption and understanding of: the basic knowledge of major areas of mathematics, and the basic knowledge of computer science. During their study, BMath degree holders also develop the following competencies: practical application of acquired knowledge in mathematics and computer science, and solving problems in other (not necessarily mathematical) areas by applying mathematical models and computers. Forms and methods of teaching contribute to the development of: the learning ability and inclination to scientific research, communication and presentation skills. Students are also encouraged to learn and speak at least one foreign language.\n\n",
            "competencies": "Learn how to maintain computer networks and security of computer systems, work with databases (SQL, noSQL, Big Data), use procedural, functional and object-oriented programming languages, deal with graphical programming (OpenGL), algorithms and data structures, create mobile, web and embedded applications, project management, as well as implementing management and artificial intelligence algorithms on dynamic (robotic) systems. In 2016, computer science students at the Department of Mathematics were declared the best in 10 of 11 categories in the field of software development in relation to other faculties (Knowledge and skills of students of Osijek faculties).\n\n",
            "end_of_study": "Undergraduate university study programme in mathematics is completed by passing all the exams and writing the final paper, which includes studying the existing literature on a given topic and a systematic presentation of the paper.\n\n"
        }
    },
    "graduate":
    {
       "financial_mathematics&statistics":
       {
            "general": "The graduate study programme of Financial Mathematics and Statistics is intended for students who have completed an undergraduate programme in mathematics or other related field. The programme is carefully balanced between advanced mathematical theories and practical skills which makes it unique in Croatia. Financial mathematics studies the problems of financial decision making by combining different techniques from theoretical and applied mathematics. Market and credit risk management, investment strategies, fund management and insurance risks management are impossible without mathematical models. Graduates of this programme are regularly employed in challenging and well-paid jobs in banks, insurance companies, pension funds, financial institutions, audit firms and as data analysts. This study is ideal for anyone who has skills for analytical problem solving and is willing to make an effort to acquire new knowledge that will enable them a promising business career. Do not worry too much about your difficulties in mathematics, I can assure you that mine are still greater. (Albert Einstein) Enrolling in the study programme of Financial Mathematics and Statistics is an investment in a successful future - all the effort invested brings multiple benefits!\n\n",
            "achievements": "After completing this study programme, graduates are awarded a Master of Mathematics (MMath) degree.\n\n",
            "competencies": "Through this programme, student also acquire an advanced knowledge of statistical methods with applications to practical problems. Students develop the ability to analyse and critically interpret data, develop statistical models in practical situations and use cutting-edge computer tools and software packages. Such knowledge and skills are applicable in all areas where there is data, and with increasing capabilities of collecting data, it is increasingly important to analyse and make quality decisions based on a large amount of data (so-called big data).\n\n",
            "end_of_study": "Graduate university study programme in mathematics is completed by passing all the exams, writing the thesis, which includes the study of the existing literature on a given topic and a systematic presentation of the paper, and passing the graduation exam.\n\n"
       },
       "mathematics&computer_science":
       {
            "general": "Master programme in Computer Science and Mathematics is our prestigious program that had the one and only purpose and that is to educate outstanding IT professionals and support IT industry with high-quality engineers. Students that are eligible to apply and wants to challenge themself with this exceptional study program should either hold a bachelor degree in mathematics or in computer science. Success is no accident. It is hard work, perseverance, learning, studying, sacrifice and most of all, love of what you are doing or learning to do (Pelé). If you are not Croatian speaking, that is not a problem. You can still apply to this program since, in case foreign students get accepted, all courses will be taught in English. Moreover, foreign students can get funding and support their studies from local IT companies. For more information please check our online platform for foreign student admissions.\n\n",
            "achievements": "",
            "competencies": "Learn how to maintain computer networks and security of computer systems, work with databases (SQL, noSQL, Big Data), use procedural, functional and object-oriented programming languages, deal with graphical programming (OpenGL), algorithms and data structures, create mobile, web and embedded applications, project management, as well as implementing management and artificial intelligence algorithms on dynamic (robotic) systems. In 2016, computer science students at the Department of Mathematics were declared the best in 10 of 11 categories in the field of software development in relation to other faculties (Knowledge and skills of students of Osijek faculties).\n\n",
            "end_of_study": "Graduate university study programme in mathematics is completed by passing all the exams, writing the thesis, which includes the study of the existing literature on a given topic and a systematic presentation of the paper, and passing the graduation exam.\n\n"  
       }
    }
}